Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport
The interface provides the methods for invoking native code in TS Core through DllImport.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.GetCustomPartExtrema(System.Int32,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@)
Gets the extrema of the custom part. These are in the custom parts own coordinate system,
since the extrema of the custom part type would be meaningless in locals.
id: The ID of the custom part.
minPoint: The minimum point of the extrema.
maxPoint: The maximum point of the extrema.
Returns: True if the extrema was successfully retrieved, otherwise false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.GetCustomPartExtrema(System.String,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@)
Gets the extrema of the custom part. These are in the custom parts own coordinate system,
since the extrema of the custom part type would be meaningless in locals.
name: The name of the custom part type.
minPoint: The minimum point of the extrema.
maxPoint: The maximum point of the extrema.
Returns: True if the extrema was successfully retrieved, otherwise false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.GetCustomPartEdges(System.String,Tekla.Structures.ModelInternal.dotEdges_t@)
Gets the edges of the custom part types geometry. These are in the custom parts own coordinate system,
since the geometry of the custom part type would be meaningless in locals.
name: The name of the custom part type.
edges: The edges of the custom part.
Returns: True if the edges were successfully retrieved, otherwise false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.SetConnectedFaces(System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotDMObjectFaces_t)
Sets the faces which are connected to the model object as the references.
id: The model object id.
objectFaces: The connected object faces.
Returns: True if the model object was successfully connected to the faces; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.GetConnectedFaces(System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotDMObjectFaces_t@)
Gets the faces which are connected to the model object as the references.
id: The model object id.
objectFaces: The connected object faces.
Returns: True if the connected faces were successfully retrieved; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.GetDmPlugin(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentData@)
Exports the get componentData data command.
componentData: The component data.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.GetPreviewSinglePolygonPolymesh(System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonFaceInput_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)
Exports the get preview polygon face command.
id: The ID of the model object lying under the picked point(s).
input: Input data consisting of planes defined as points and normals.
output: Output data as polymesh containing preview polygons.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.GetActualSinglePolygonPolymesh(System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonFaceInput_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)
Exports the get actual polygon face command.
id: The ID of the model object lying under the picked point(s).
input: Input data consisting of planes defined as points and normals.
output: Output data as polymesh containing actual polygons.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.GetPreviewPolylinePolymeshForCreation(System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonalPourBreakInput_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)
Exports the get preview polyline polymesh command for the creation of polyline pour break.
id: The ID of the model object lying under the picked point(s).
input: Input data consisting of polyline points and extension direction.
output: Output data as single polygon polymesh.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.GetActualPolylinePolymeshForCreation(System.Int32,Tekla.Structures.ModelInternal.dotPolymesh_t@)
Exports the get actual geometry polyline pour break command for the creation of polyline pour break.
id: The ID of the model object lying under the picked point(s).
polymesh: Input/output data as polymesh.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.GetPreviewPolylinePolymeshesForSplitting(System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonalPourBreakInput_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)
Exports the get preview polyline polymesh command for the splitting by polyline feature
id: The ID of the model object lying under the picked point(s).
input: Input data consisting of polyline points and extension direction.
output: Output data as single polygon polymesh.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.GetActualPolylinePolymeshesForSplitting(System.Int32,Tekla.Structures.ModelInternal.dotPolymesh_t@)
Exports the get actual geometry polyline pour break command for the splitting by polyline feature
id: The ID of the model object (part) lying under the picked point(s).
polymesh: Input/output data as polymesh. Input is a "tentative" polymesh, output is validated
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.GetPreviewPolylinePolymeshForModification(System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonalPourBreakInput_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)
Exports the get preview polymesh command for the modification of pour break.
breakId: The ID of the pour break being modified.
input: Input data consisting of polyline points and extension direction.
output: Output data as polymesh consists of preview polygons.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.GetActualPolylinePolymeshForModification(System.Int32,Tekla.Structures.ModelInternal.dotPolymesh_t@)
Exports the get actual geometry command for the modification of pour break.
breakId: The ID of the pour break being modified.
polymesh: Input/output data as polymesh.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.ExportIntListHandler(Tekla.Structures.ModelInternal.dotnetIntList_t@)
Exports the integer list handler.
pIntList: The integer list.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.ImportIntListHandler(Tekla.Structures.ModelInternal.dotnetIntList_t@)
Imports the integer list handler.
pIntList: The integer list.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.ExportDoubleListHandler(Tekla.Structures.ModelInternal.dotnetDoubleList_t@)
Exports the double list handler.
pDoubleList: The double list.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.ImportDoubleListHandler(Tekla.Structures.ModelInternal.dotnetDoubleList_t@)
Imports the double list handler.
pDoubleList: The double list.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.ExportPointListHandler(Tekla.Structures.ModelInternal.dotnetPointList_t@)
Exports the point list handler.
pPointList: The integer list.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.ImportPointListHandler(Tekla.Structures.ModelInternal.dotnetPointList_t@)
Imports the point list handler.
pPointList: The integer list.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.RebarGuidelineCalculateSpacingActuals(Tekla.Structures.ModelInternal.dotRebarSpacing_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t}@,System.Double)
Calculates the guideline spacing 'actuals'.
dotSpacing: The spacing data.
dotSpacingZoneList: The zones.
guidelineLength: The guideline length.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.RebarGuidelineGetActualCurve(System.Int32,System.Int32,System.Collections.Generic.List{Tekla.Structures.DirectManipulation.Adapter.Native.dotBool}@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool@)
Gets the guideline 'actual' curve.
id: The guideline ID.
rebarsetId: The rebarset ID.
dotIsArcList: The is arc flags.
dotPointList: The points.
followsEdges: The curve follows an edge.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.RebarStripGetActualCurve(System.Int32,System.Collections.Generic.List{Tekla.Structures.DirectManipulation.Adapter.Native.dotBool}@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool@)
Gets the strip 'actual' curve.
stripId: The strip ID.
dotIsArcList: The is arc flags.
dotPointList: The points.
followsEdges: The curve follows an edge.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.RebarSetGetBarSurface(System.Int32,System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotBarSurface_t@)
Get the bar surface geometry for the given rebar set and bar ids.
rebarSetId: The rebar set id.
barId: The bar id.
barSurface: The bar surface.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.RebarSetGetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarSet_t@,Tekla.Structures.ModelInternal.dotGuideline_t@,Tekla.Structures.ModelInternal.dotLegFace_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t})
The rebar set get applied attributes method.
dotRebarSet: The dot rebar set.
dotGuideline: The dot guideline.
dotLegFace: The dot leg face.
dotSpacingZoneList: The zones.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.PropertyStripGetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
The property strip get applied attributes method.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.EndDetailStripGetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
The end detail strip get applied attributes method.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.SplitterStripGetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
The splitter strip get applied attributes method.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.RebarSetSetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarSet_t@,Tekla.Structures.ModelInternal.dotGuideline_t@,Tekla.Structures.ModelInternal.dotLegFace_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t})
The rebar set set applied attributes method.
dotRebarSet: The dot rebar set.
dotGuideline: The dot guideline.
dotLegFace: The dot leg face.
dotSpacingZoneList: The zones.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.PropertyStripSetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
The property strip set applied attributes method.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.EndDetailStripSetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
The end detail strip set applied attributes method.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.SplitterStripSetAppliedAttributes(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
The splitter strip set applied attributes method.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.RebarSetLoadDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarSet_t@,Tekla.Structures.ModelInternal.dotGuideline_t@,Tekla.Structures.ModelInternal.dotLegFace_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t})
The rebar set load dialog attributes method.
filename: The filename.
dotRebarSet: The dot rebar set.
dotGuideline: The dot guideline.
dotLegFace: The dot leg face.
dotSpacingZoneList: The zones.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.PropertyStripLoadDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
The property strip load dialog attributes method.
filename: The filename.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.EndDetailStripLoadDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
The end detail strip load dialog attributes method.
filename: The filename.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.SplitterStripLoadDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
The splitter strip load dialog attributes method.
filename: The filename.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.RebarSetSaveDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarSet_t@,Tekla.Structures.ModelInternal.dotGuideline_t@,Tekla.Structures.ModelInternal.dotLegFace_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t})
The rebar set save dialog attributes method.
filename: The filename.
dotRebarSet: The dot rebar set.
dotGuideline: The dot guideline.
dotLegFace: The dot leg face.
dotSpacingZoneList: The zones.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.PropertyStripSaveDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
The property strip save dialog attributes method.
filename: The filename.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.EndDetailStripSaveDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
The end detail strip save dialog attributes method.
filename: The filename.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.SplitterStripSaveDialogAttributes(System.String,Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
The splitter strip save dialog attributes method.
filename: The filename.
dotStrip: The dot strip.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.RebarSetDisplayUDAsDialog(System.Int32,System.Int32)
The rebar set display UDAs dialog method.
id: The id.
type: The type.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.RebarSetGetAppliedUDAs(Tekla.Structures.ModelInternal.dotGetProperties_t@,System.Int32)
The rebar set get applied UDAs method.
pProperties: The properties.
type: The type.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.RebarSetAutomaticGuidelineOffsets(System.Int32,System.Int32,System.Double@,System.Double@)
Calculates the spacing start/end offsets if those values are set to automatic.
rebarSetId: The rebar set id.
guidelineId: The guideline id.
startOffset: The calculated start offset.
endOffset: The calculated end offset.
Returns: True if successful, false otherwise.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.CheckForAndHandleNewCreatedDuplicates(System.Int32)
Checks whether given newly created object has duplicates in place.
If duplicate found, user prompt opens and asks user to keep, delete or cancel.
id: Object ID that is newly created.
Returns: True if user opted to delete the newly created duplicate object; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.ChangeLegFaceLayer(System.Int32,System.Collections.Generic.List{System.Int32},System.Int32)
Changes the legface layering of the given faces from the given rebar set.
rebarSetId: The id of the rebar set.
legFaceIds: The ids of the legfaces belonging to the rebar set.
action: The change to apply.
Returns: True if successful and result is different to previous.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.CreateRebarSetSurfaceObjectRelation(System.Int32,System.Int32)
Creates the rebar set/surface object relation.
rebarSetId: The rebar set ID.
surfaceObjectId: The surface object ID.
Returns: The new relation ID.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.SelectInViews(Tekla.Structures.ModelInternal.dotUIModelObjectSelector_t@,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool)
Selects the model objects in views.
pSelector: The model object selector.
useSubIds: A value indicating whether to use the object sub ids for selection.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.GetSurfacePreviewForCreation(System.Int32,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.ModelInternal.dotPolymesh_t@)
Gets the preview for the surface object.
id: The ID of the underlying model object.
pointOnFace: The point on the face of the underlying model object.
faceNormal: The normal of the face of the underlying model object.
output: Output data as surface preview.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.ExtendWorkAreaOrViewDepth(System.Collections.Generic.IEnumerable{System.Int32})
Checks and extends the work area or view depth based on the model object ids.
objectIds: The model object ids.
Returns: True if the work area or view depth should be expanded; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.FitWorkArea(System.Int32,System.Int32)
Fits the work area of the view with viewId.
viewId: The view ID.
onSelectedObjects: Whether the work area is fit based on the selected objects.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.CheckAutoSaveState
Checks the auto-save state (increase the command count and trigger auto-save if needed).
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.CleanShapeFromSolidCache(System.String)
Clean the solid cache with the given shape GUID.
shapeGuid: The shape GUID.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.CreateDmHandle(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t@)
Shows the bitmap associated to Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t.BitmapIdentifier on Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t.Location.
handle: The handle to show a bitmap on.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.CreateDmBitmap(System.Int32,Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmap_t@)
Loads the bitmap of a handle on TS core side.
bitmapTargetType: The target type of the bitmap.
bitmap: The bitmap.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.SetDmHandleLocation(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t@)
Modifies the location of the bitmap associated to Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t.BitmapIdentifier.
handle: The handle.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.DeleteDmHandle(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t@)
Removes the bitmap on Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t.Location.
handle: The handle on which the bitmap is located.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.DmGetTemporaryGraphicsId(System.Int32@)
Exports the get temporary id command.
id: The identifier.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.DmRemoveTemporaryGraphics(System.Int32,System.Int32)
Exports the remove temporary graphics command.
id: The identifier.
subId: The sub-identifier.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.DmDrawTemporaryLines(Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolyLine_t@)
Exports the draw temporary lines command.
pArgument: The argument.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.DmDrawTemporaryPolyLine(Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolyLine_t@)
Exports the draw temporary polyline command.
pArgument: The argument.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.DmDrawTemporaryPolygonFace(Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolygonFace_t@)
Exports the draw temporary polygon face command.
pArgument: The argument.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.SetUpdateRebarSetAppliedUdaCallback(Tekla.Structures.DirectManipulation.Model.UpdateRebarSetAppliedUDAsDelegate)
Sets a callback for when the applied UDA values are changed for the RebarSet class.
p: The function to call when the values are changed.